# 切片是Python序列的重要操作之一，適用於清單、元組、字串、range物件等類型
# 切片使用2個冒號分隔的3個數字來完成：
# 第一個數字表示切片的起始位置，預設為0
# 第二個數字表是切片的截止（但不包含）位置（預設為清單長度)
# 第三個數字表示切片的步長(預設為1)，當步長省略時，順便可以省略最後一個冒號

aList=[3,4,5,6,7,9,11,13,15,17]
print(aList[::])  #[3, 4, 5, 6, 7, 9, 11, 13, 15, 17]
print(aList[::-1])  #[17, 15, 13, 11, 9, 7, 6, 5, 4, 3]
#加了负号，就是一个逆向输出
print(aList[::2])  # [3, 5, 7, 11, 15]
#以步长为2进行输出，输出下标依次为0 2 4 6
print(aList[1::2])  #[4, 6, 9, 13, 17],从一开始步长为2
print(aList[3::])  #[6, 7, 9, 11, 13, 15, 17]
print(aList[3:6])  #省略的是步长，而且不包括下标为6的元素   #[6, 7, 9]

# 利用切片方法實現列表的增加
aList=[3,5,7]
print(aList[len(aList):])   #[]
#利用切片方法实现列表的增加
aList[len(aList):]=[9]  #把原来三位列表的第四位赋值为9
print(aList)  #[3, 5, 7, 9] 

# 利用切片方法實現列表元素的修改
#aList = [3,5,7,9]
aList[:3]=[1,2,3]
print(aList)  #[1, 2, 3, 9]
aList[:3]=[]
print(aList)  #[9]

aList=list(range(10))
print(aList)  #[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
aList[::2]=[0]*(len(aList)//2)  #"//"整除
print(aList)  #[0, 1, 0, 3, 0, 5, 0, 7, 0, 9]

# del指令結合來刪除清單中的部分元素
aList=[3,5,7,9,11]
del aList[:3]
print(aList)  #[9, 11]